* GUEST EXECUTABLE ANCHORS. NO QSAM OR OS MACROS REQUIRED.
         COPY  INSWORK
INSSMOK  INSENT
         LA    11,AREA
         USING WORK,11
         XC    SREC,SREC
         MVC   SID,=C'00000001'
         MVC   SISSUE,=F'20240101'
         MVC   SDATE,SISSUE
         ZAP   SFACE,=PL7'1000000'
         ZAP   SCASH,=PL7'100000'
         ZAP   SLOAN,=P'0'
         XC    TREC,TREC
         MVC   TID,SID
         MVC   TSEQ,=F'1'
         MVC   TDATE,=F'20250101'
         MVI   TOP,C'P'
         ZAP   TAMT,=P'10000'
         LR    1,11
         L     15,=V(INSCALC)
         BALR  14,15
         CLC   OSTAT,=C'OKAY'
         BNE   BAD
         CP    OINT,=P'3259'
         BNE   BAD
         CP    OCASH,=P'113259'
         BNE   BAD
         CP    OCHG,=P'3964'
         BNE   BAD
         CP    OSURR,=P'109295'
         BNE   BAD
         CP    ODEATH,=P'1000000'
         BNE   BAD
         CLC   OAGE,=F'1'
         BNE   BAD
         LR    1,11
         L     15,=V(INSCALC)
         BALR  14,15
         CLC   OSTAT,=C'DUPL'
         BNE   BAD
         MVC   TSEQ,=F'2'
         MVI   TOP,C'W'
         ZAP   TAMT,=P'9999999'
         LR    1,11
         L     15,=V(INSCALC)
         BALR  14,15
         CLC   OSTAT,=C'FUND'
         BNE   BAD
         CP    SCASH,=P'113259'
         BNE   BAD
         CLC   SSEQ,=F'1'
         BNE   BAD
         ZAP   TAMT,=P'-1'
         LR    1,11
         L     15,=V(INSCALC)
         BALR  14,15
         CLC   OSTAT,=C'NEGA'
         BNE   BAD
         MVI   TAMT,X'FF'
         LR    1,11
         L     15,=V(INSCALC)
         BALR  14,15
         CLC   OSTAT,=C'PACK'
         BNE   BAD
         SR    15,15
         B     RETURN
BAD      LA    15,12
RETURN   INSRET
         LTORG
SAVE     DS    18F
         DS    0D
AREA     DS    (WORKLEN)C
         END   INSSMOK
