         MACRO
&NAME    INSENT
&NAME    CSECT
         STM   14,12,12(13)
         LR    12,15
         USING &NAME,12
         LA    15,SAVE
         ST    13,4(15)
         ST    15,8(13)
         LR    13,15
         MEND
