WORK     DSECT
SREC     DS    0CL128
SID      DS    CL8
SISSUE   DS    F
SDATE    DS    F
SSEQ     DS    F
SFACE    DS    PL7
SCASH    DS    PL7
SLOAN    DS    PL7
SPAD     DS    XL7
SLAST    DS    CL40
STAIL    DS    XL40
TREC     DS    0CL40
TID      DS    CL8
TSEQ     DS    F
TDATE    DS    F
TOP      DS    CL1
TPAD     DS    XL3
TAMT     DS    PL7
TTAIL    DS    XL13
OREC     DS    0CL96
OID      DS    CL8
OSEQ     DS    F
ODATE    DS    F
OSTAT    DS    CL4
OOP      DS    CL1
OPAD     DS    XL3
OAGE     DS    F
ORATE    DS    PL3
OFEE     DS    PL3
OCASH    DS    PL7
OSURR    DS    PL7
ODEATH   DS    PL7
OLOAN    DS    PL7
OINT     DS    PL7
OCHG     DS    PL7
OVERS    DS    CL4
OTAIL    DS    XL16
WDATE    DS    F
WYEAR    DS    F
WMD      DS    F
WORD     DS    F
WVALID   DS    F
WOLDORD  DS    F
WISSYR   DS    F
WISSMD   DS    F
WAGE     DS    F
WDAYS    DS    F
WRATE    DS    PL3
WFEE     DS    PL3
         DS    0D
WNUM     DS    PL8
WPROD    DS    PL12
WBEFORE  DS    CL128
WORKLEN  EQU   *-WORK
