//INSBUILD JOB (@ACCOUNT@),'SYNTHETIC INS',CLASS=@CLASS@,
//             MSGCLASS=@MSGCLASS@,MSGLEVEL=(1,1)
//* PREALLOCATE @HLQ@.SRC/.MAC/.OBJ/.LOAD AS IN HANDOFF.
//ASMPROC PROC MEMBER=
//ASM      EXEC PGM=IFOX00,REGION=1024K,
//             PARM='DECK,NOLOAD,LIST,NORENT',COND=(0,NE)
//SYSLIB   DD DSN=@HLQ@.MAC,DISP=SHR
@SYSLIB@
//SYSIN    DD DSN=@HLQ@.SRC(&MEMBER),DISP=SHR
//SYSPUNCH DD DSN=@HLQ@.OBJ(&MEMBER),DISP=OLD
//SYSGO    DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//         PEND
//ACALC    EXEC ASMPROC,MEMBER=INSCALC
//AVAL     EXEC ASMPROC,MEMBER=INSVAL
//APACK    EXEC ASMPROC,MEMBER=INSPACK
//ADATE    EXEC ASMPROC,MEMBER=INSDATE
//ARATE    EXEC ASMPROC,MEMBER=INSRATE
//ASMOK    EXEC ASMPROC,MEMBER=INSSMOK
//ABAT     EXEC ASMPROC,MEMBER=INSBAT
//LSMOK    EXEC PGM=IEWL,PARM='LIST,MAP,XREF,NCAL',COND=(0,NE)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLMOD  DD DSN=@HLQ@.LOAD,DISP=OLD
//OBJ      DD DSN=@HLQ@.OBJ,DISP=SHR
//SYSLIN   DD *
 INCLUDE OBJ(INSSMOK)
 INCLUDE OBJ(INSCALC)
 INCLUDE OBJ(INSVAL)
 INCLUDE OBJ(INSPACK)
 INCLUDE OBJ(INSDATE)
 INCLUDE OBJ(INSRATE)
 ENTRY INSSMOK
 NAME INSSMOK(R)
/*
//LBAT     EXEC PGM=IEWL,PARM='LIST,MAP,XREF,NCAL',COND=(0,NE)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLMOD  DD DSN=@HLQ@.LOAD,DISP=OLD
//OBJ      DD DSN=@HLQ@.OBJ,DISP=SHR
//SYSLIN   DD *
 INCLUDE OBJ(INSBAT)
 INCLUDE OBJ(INSCALC)
 INCLUDE OBJ(INSVAL)
 INCLUDE OBJ(INSPACK)
 INCLUDE OBJ(INSDATE)
 INCLUDE OBJ(INSRATE)
 ENTRY INSBAT
 NAME INSBAT(R)
/*
//SMOKE    EXEC PGM=INSSMOK,REGION=512K,TIME=(1,0),COND=(0,NE)
//STEPLIB  DD DSN=@HLQ@.LOAD,DISP=SHR
//SYSUDUMP DD SYSOUT=*
//
