//INSHOST  JOB (@ACCOUNT@),'HOST OBJECT INS',CLASS=@CLASS@,
//             MSGCLASS=@MSGCLASS@,MSGLEVEL=(1,1)
//* LOAD HOST AS370 FB80 DECKS INTO @HLQ@.OBJ BEFORE THIS JOB.
//LSMOK    EXEC PGM=IEWL,PARM='LIST,MAP,XREF',REGION=2048K
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLMOD  DD DSN=@HLQ@.LOAD,DISP=OLD
//OBJ      DD DSN=@HLQ@.OBJ,DISP=SHR
//SYSLIN   DD *
 INCLUDE OBJ(INSSMOK)
 INCLUDE OBJ(INSCALC)
 INCLUDE OBJ(INSVAL)
 INCLUDE OBJ(INSPACK)
 INCLUDE OBJ(INSDATE)
 INCLUDE OBJ(INSRATE)
 ENTRY INSSMOK
 NAME INSSMOK(R)
/*
//LBAT     EXEC PGM=IEWL,PARM='LIST,MAP,XREF',COND=(0,NE),
//             REGION=2048K
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLMOD  DD DSN=@HLQ@.LOAD,DISP=OLD
//OBJ      DD DSN=@HLQ@.OBJ,DISP=SHR
//SYSLIN   DD *
 INCLUDE OBJ(INSBAT)
 INCLUDE OBJ(INSCALC)
 INCLUDE OBJ(INSVAL)
 INCLUDE OBJ(INSPACK)
 INCLUDE OBJ(INSDATE)
 INCLUDE OBJ(INSRATE)
 ENTRY INSBAT
 NAME INSBAT(R)
/*
//SMOKE    EXEC PGM=INSSMOK,REGION=512K,TIME=(1,0),COND=(0,NE)
//STEPLIB  DD DSN=@HLQ@.LOAD,DISP=SHR
//SYSUDUMP DD SYSOUT=*
//
