//INSRUN   JOB (@ACCOUNT@),'SYNTHETIC INS',CLASS=@CLASS@,
//             MSGCLASS=@MSGCLASS@,MSGLEVEL=(1,1)
//* USE A NEW RUN DATASET PREFIX; NEVER OVERWRITE AN INPUT GENERATION.
//RUN      EXEC PGM=INSBAT,REGION=512K,TIME=(2,0)
//STEPLIB  DD DSN=@HLQ@.LOAD,DISP=SHR
//POLIN    DD DSN=@POLIN@,DISP=OLD,
//             DCB=(RECFM=FB,LRECL=128,BLKSIZE=1280)
//TXNIN    DD DSN=@TXNIN@,DISP=OLD,
//             DCB=(RECFM=FB,LRECL=40,BLKSIZE=4000)
//POLOUT   DD DSN=@RUN@.POL,DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(20,5)),
//             DCB=(RECFM=FB,LRECL=128,BLKSIZE=1280)
//RESOUT   DD DSN=@RUN@.RES,DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(100,20)),
//             DCB=(RECFM=FB,LRECL=96,BLKSIZE=9600)
//SYSUDUMP DD SYSOUT=*
//
